tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1764_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1764_H_
#define _PIC16F1764_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTC                         42
#define RC0                           43
#define RC                            44
#define RC1                           45
#define RC2                           46
#define RC3                           47
#define RC4                           48
#define RC5                           49
#define PIR1                          50
#define TMR1IF                        51
#define TMR2IF                        52
#define CCP1IF                        53
#define CCPIF                         54
#define SSP1IF                        55
#define TXIF                          56
#define RCIF                          57
#define ADIF                          58
#define TMR1GIF                       59
#define PIR2                          60
#define BCL1IF                        61
#define C1IF                          62
#define C2IF                          63
#define OSFIF                         64
#define PIR3                          65
#define CLC1IF                        66
#define CLC2IF                        67
#define CLC3IF                        68
#define ZCDIF                         69
#define COG1IF                        70
#define PWM5IF                        71
#define PIR4                          72
#define TMR4IF                        73
#define TMR6IF                        74
#define TMR3IF                        75
#define TMR3GIF                       76
#define TMR5IF                        77
#define TMR5GIF                       78
#define TMR0                          79
#define TMR1L                         80
#define TMR1L_TMR                     81
#define TMR1H                         82
#define TMR1H_TMR                     83
#define T1CON                         84
#define T1CON_TMRON                   85
#define TMR1ON                        86
#define T1CON_ON                      87
#define T1ON                          88
#define T1CON_nSYNC                   89
#define T1CON_SYNC                    90
#define nT1SYNC                       91
#define T1OSCEN                       92
#define OSCEN                         93
#define SOSCEN                        94
#define T1CKPS0                       95
#define T1CON_CKPS0                   96
#define T1CON_CKPS                    97
#define T1CON_CKPS1                   98
#define T1CKPS1                       99
#define T1CS0                         100
#define T1CON_CS0                     101
#define TMR1CS0                       102
#define T1CON_CS                      103
#define T1CS1                         104
#define T1CON_CS1                     105
#define TMR1CS1                       106
#define T1GCON                        107
#define T1GCON_GSS0                   108
#define T1GCON_GSS                    109
#define T1GSS0                        110
#define T1GCON_GSS1                   111
#define T1GSS1                        112
#define T1GCON_GVAL                   113
#define T1GVAL                        114
#define T1GGO_nDONE                   115
#define T1GCON_GGO_nDONE              116
#define T1GCON_GSPM                   117
#define T1GSPM                        118
#define T1GTM                         119
#define T1GCON_GTM                    120
#define T1GPOL                        121
#define T1GCON_GPOL                   122
#define T1GCON_GE                     123
#define TMR1GE                        124
#define T1GE                          125
#define T2TMR                         126
#define TMR2                          127
#define T2TMR_TMR                     128
#define T2PR                          129
#define T2PR_PR                       130
#define T2CON                         131
#define T2OUTPS0                      132
#define T2CON_OUTPS0                  133
#define T2OUTPS                       134
#define T2CON_OUTPS                   135
#define T2OUTPS1                      136
#define T2CON_OUTPS1                  137
#define T2OUTPS2                      138
#define T2CON_OUTPS2                  139
#define T2OUTPS3                      140
#define T2CON_OUTPS3                  141
#define T2CKPS0                       142
#define T2CON_CKPS0                   143
#define T2CON_CKPS                    144
#define T2CKPS                        145
#define T2CKPS1                       146
#define T2CON_CKPS1                   147
#define T2CKPS2                       148
#define T2CON_CKPS2                   149
#define T2CON_ON                      150
#define TMR2ON                        151
#define T2ON                          152
#define T2HLT                         153
#define T2HLT_MODE                    154
#define T2MODE                        155
#define T2MODE0                       156
#define T2HLT_MODE0                   157
#define T2MODE1                       158
#define T2HLT_MODE1                   159
#define T2MODE2                       160
#define T2HLT_MODE2                   161
#define T2MODE3                       162
#define T2HLT_MODE3                   163
#define T2MODE4                       164
#define T2HLT_MODE4                   165
#define T2HLT_CKSYNC                  166
#define T2CKSYNC                      167
#define T2HLT_CKPOL                   168
#define T2CKPOL                       169
#define T2PSYNC                       170
#define T2HLT_PSYNC                   171
#define T2CLKCON                      172
#define T2CS                          173
#define T2CS0                         174
#define T2CLKCON_CS                   175
#define T2CLKCON_CS0                  176
#define T2CS1                         177
#define T2CLKCON_CS1                  178
#define T2CS2                         179
#define T2CLKCON_CS2                  180
#define T2CS3                         181
#define T2CLKCON_CS3                  182
#define T2RST                         183
#define T2RSEL0                       184
#define T2RST_RSEL                    185
#define T2RSEL                        186
#define T2RST_RSEL0                   187
#define T2RSEL1                       188
#define T2RST_RSEL1                   189
#define T2RST_RSEL2                   190
#define T2RSEL2                       191
#define T2RSEL3                       192
#define T2RST_RSEL3                   193
#define TRISA                         194
#define TRISA0                        195
#define TRISA1                        196
#define TRISA2                        197
#define TRISA4                        198
#define TRISA5                        199
#define TRISC                         200
#define TRISC0                        201
#define TRISC1                        202
#define TRISC2                        203
#define TRISC3                        204
#define TRISC4                        205
#define TRISC5                        206
#define PIE1                          207
#define TMR1IE                        208
#define TMR2IE                        209
#define CCP1IE                        210
#define CCPIE                         211
#define SSP1IE                        212
#define TXIE                          213
#define RCIE                          214
#define ADIE                          215
#define TMR1GIE                       216
#define PIE2                          217
#define BCL1IE                        218
#define C1IE                          219
#define C2IE                          220
#define OSFIE                         221
#define PIE3                          222
#define CLC1IE                        223
#define CLC2IE                        224
#define CLC3IE                        225
#define ZCDIE                         226
#define COGIE                         227
#define PWM5IE                        228
#define PIE4                          229
#define TMR4IE                        230
#define TMR6IE                        231
#define TMR3IE                        232
#define TMR3GIE                       233
#define TMR5IE                        234
#define TMR5GIE                       235
#define OPTION_REG                    236
#define OPTION_REG_PS                 237
#define OPTION_REG_PS0                238
#define OPTION_REG_PS1                239
#define OPTION_REG_PS2                240
#define PSA                           241
#define T0SE                          242
#define TMR0SE                        243
#define T0CS                          244
#define TMR0CS                        245
#define INTEDG                        246
#define nWPUEN                        247
#define PCON                          248
#define nBOR                          249
#define nPOR                          250
#define nRI                           251
#define nRMCLR                        252
#define nRWDT                         253
#define STKUNF                        254
#define STKOVF                        255
#define WDTCON                        256
#define SWDTEN                        257
#define WDTPS                         258
#define WDTPS0                        259
#define WDTPS1                        260
#define WDTPS2                        261
#define WDTPS3                        262
#define WDTPS4                        263
#define OSCTUNE                       264
#define TUN0                          265
#define TUN                           266
#define TUN1                          267
#define TUN2                          268
#define TUN3                          269
#define TUN4                          270
#define TUN5                          271
#define OSCCON                        272
#define SCS0                          273
#define SCS                           274
#define SCS1                          275
#define IRCF                          276
#define IRCF0                         277
#define IRCF1                         278
#define IRCF2                         279
#define IRCF3                         280
#define SPLLEN                        281
#define OSCSTAT                       282
#define HFIOFS                        283
#define LFIOFR                        284
#define MFIOFR                        285
#define HFIOFL                        286
#define HFIOFR                        287
#define OSTS                          288
#define PLLR                          289
#define SOSCR                         290
#define ADRESL                        291
#define ADRESH                        292
#define ADCON0                        293
#define ADON                          294
#define GO_nDONE                      295
#define ADCON0_GO                     296
#define ADGO                          297
#define CHS0                          298
#define CHS                           299
#define CHS1                          300
#define CHS2                          301
#define CHS3                          302
#define CHS4                          303
#define ADCON1                        304
#define ADPREF0                       305
#define ADPREF                        306
#define ADPREF1                       307
#define ADNREF                        308
#define ADCS                          309
#define ADFM                          310
#define ADCON2                        311
#define TRIGSEL                       312
#define TRIGSEL0                      313
#define TRIGSEL1                      314
#define TRIGSEL2                      315
#define TRIGSEL3                      316
#define TRIGSEL4                      317
#define LATA                          318
#define LATA0                         319
#define LATA1                         320
#define LATA2                         321
#define LATA4                         322
#define LATA5                         323
#define LATC                          324
#define LATC0                         325
#define LATC1                         326
#define LATC2                         327
#define LATC3                         328
#define LATC4                         329
#define LATC5                         330
#define CMOUT                         331
#define MC1OUT                        332
#define MC2OUT                        333
#define CM1CON0                       334
#define C1SYNC                        335
#define CM1CON0_SYNC                  336
#define CM1CON0_HYS                   337
#define C1HYS                         338
#define C1SP                          339
#define CM1CON0_ZLF                   340
#define C1ZLF                         341
#define CM1CON0_POL                   342
#define C1POL                         343
#define C1OUT                         344
#define CM1CON0_OUT                   345
#define CM1CON0_ON                    346
#define C1ON                          347
#define CM1CON1                       348
#define C1INTN                        349
#define CM1CON1_INTN                  350
#define CM1CON1_INTP                  351
#define C1INTP                        352
#define CM1NSEL                       353
#define CM1NSEL_NCH0                  354
#define C1NCH0                        355
#define CM1NSEL_NCH                   356
#define C1NCH                         357
#define CM1NSEL_NCH1                  358
#define C1NCH1                        359
#define CM1NSEL_NCH2                  360
#define C1NCH2                        361
#define CM1PSEL                       362
#define CM1PSEL_PCH                   363
#define C1PCH                         364
#define C1PCH0                        365
#define CM1PSEL_PCH0                  366
#define C1PCH1                        367
#define CM1PSEL_PCH1                  368
#define C1PCH2                        369
#define CM1PSEL_PCH2                  370
#define C1PCH3                        371
#define CM1PSEL_PCH3                  372
#define CM2CON0                       373
#define CM2CON0_SYNC                  374
#define C2SYNC                        375
#define C2HYS                         376
#define CM2CON0_HYS                   377
#define C2SP                          378
#define C2ZLF                         379
#define CM2CON0_ZLF                   380
#define C2POL                         381
#define CM2CON0_POL                   382
#define C2OUT                         383
#define CM2CON0_OUT                   384
#define CM2CON0_ON                    385
#define C2ON                          386
#define CM2CON1                       387
#define C2INTN                        388
#define CM2CON1_INTN                  389
#define CM2CON1_INTP                  390
#define C2INTP                        391
#define CM2NSEL                       392
#define C2NCH0                        393
#define CM2NSEL_NCH0                  394
#define C2NCH                         395
#define CM2NSEL_NCH                   396
#define C2NCH1                        397
#define CM2NSEL_NCH1                  398
#define C2NCH2                        399
#define CM2NSEL_NCH2                  400
#define CM2PSEL                       401
#define CM2PSEL_PCH                   402
#define C2PCH                         403
#define C2PCH0                        404
#define CM2PSEL_PCH0                  405
#define C2PCH1                        406
#define CM2PSEL_PCH1                  407
#define CM2PSEL_PCH2                  408
#define C2PCH2                        409
#define CM2PSEL_PCH3                  410
#define C2PCH3                        411
#define ANSELA                        412
#define ANSA0                         413
#define ANSA1                         414
#define ANSA2                         415
#define ANSA4                         416
#define ANSELC                        417
#define ANSC0                         418
#define ANSC1                         419
#define ANSC2                         420
#define ANSC3                         421
#define PMADRL                        422
#define PMADRH                        423
#define PMDATL                        424
#define PMDATH                        425
#define PMCON1                        426
#define RD                            427
#define WR                            428
#define WREN                          429
#define WRERR                         430
#define FREE                          431
#define LWLO                          432
#define CFGS                          433
#define PMCON2                        434
#define VREGCON                       435
#define VREGPM                        436
#define RC1REG                        437
#define TX1REG                        438
#define SP1BRGL                       439
#define SP1BRGH                       440
#define RC1STA                        441
#define RX9D                          442
#define OERR                          443
#define FERR                          444
#define ADDEN                         445
#define CREN                          446
#define SREN                          447
#define RX9                           448
#define SPEN                          449
#define TX1STA                        450
#define TX9D                          451
#define TRMT                          452
#define BRGH                          453
#define SENDB                         454
#define TX1STA_SYNC                   455
#define TXEN                          456
#define TX9                           457
#define CSRC                          458
#define BAUD1CON                      459
#define ABDEN                         460
#define WUE                           461
#define BRG16                         462
#define SCKP                          463
#define RCIDL                         464
#define ABDOVF                        465
#define WPUA                          466
#define WPUA0                         467
#define WPUA1                         468
#define WPUA2                         469
#define WPUA3                         470
#define WPUA4                         471
#define WPUA5                         472
#define WPUC                          473
#define WPUC0                         474
#define WPUC1                         475
#define WPUC2                         476
#define WPUC3                         477
#define WPUC4                         478
#define WPUC5                         479
#define SSP1BUF                       480
#define BUF                           481
#define BUF0                          482
#define SSP1BUF0                      483
#define BUF1                          484
#define SSP1BUF1                      485
#define BUF2                          486
#define SSP1BUF2                      487
#define BUF3                          488
#define SSP1BUF3                      489
#define BUF4                          490
#define SSP1BUF4                      491
#define BUF5                          492
#define SSP1BUF5                      493
#define BUF6                          494
#define SSP1BUF6                      495
#define BUF7                          496
#define SSP1BUF7                      497
#define ADD0                          498
#define ADD                           499
#define SSP1ADD0                      500
#define SSP1ADD                       501
#define ADD1                          502
#define SSP1ADD1                      503
#define ADD2                          504
#define SSP1ADD2                      505
#define ADD3                          506
#define SSP1ADD3                      507
#define ADD4                          508
#define SSP1ADD4                      509
#define ADD5                          510
#define SSP1ADD5                      511
#define ADD6                          512
#define SSP1ADD6                      513
#define ADD7                          514
#define SSP1ADD7                      515
#define SSP1MSK0                      516
#define SSP1MSK                       517
#define MSK0                          518
#define MSK                           519
#define SSP1MSK1                      520
#define MSK1                          521
