tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1764_tdd.h
#define DAC1R13                       1091
#define DAC1REF13                     1092
#define R14                           1093
#define REF14                         1094
#define DAC1R14                       1095
#define DAC1REF14                     1096
#define R15                           1097
#define REF15                         1098
#define DAC1R15                       1099
#define DAC1REF15                     1100
#define DAC3CON0                      1101
#define DAC3CON0_DACNSS               1102
#define DAC3NSS                       1103
#define DAC3CON0_NSS                  1104
#define DAC3CON0_PSS                  1105
#define DAC3PSS0                      1106
#define DAC3CON0_DACPSS               1107
#define DAC3PSS                       1108
#define DAC3CON0_PSS0                 1109
#define DAC3CON0_DACPSS0              1110
#define DAC3PSS1                      1111
#define DAC3CON0_PSS1                 1112
#define DAC3CON0_DACPSS1              1113
#define DAC3OE1                       1114
#define DAC3CON0_DACOE1               1115
#define DAC3CON0_OE1                  1116
#define DAC3EN                        1117
#define DAC3CON0_EN                   1118
#define DAC3CON0_DACEN                1119
#define DAC3REF                       1120
#define DAC3REF0                      1121
#define DAC3R                         1122
#define DACR0                         1123
#define DAC3REF_R0                    1124
#define DACR                          1125
#define DAC3REF_REF0                  1126
#define DAC3R0                        1127
#define DAC3REF1                      1128
#define DACR1                         1129
#define DAC3REF_R1                    1130
#define DAC3REF_REF1                  1131
#define DAC3R1                        1132
#define DAC3REF2                      1133
#define DACR2                         1134
#define DAC3REF_R2                    1135
#define DAC3REF_REF2                  1136
#define DAC3R2                        1137
#define DAC3REF3                      1138
#define DACR3                         1139
#define DAC3REF_REF3                  1140
#define DAC3REF_R3                    1141
#define DAC3R3                        1142
#define DAC3REF4                      1143
#define DACR4                         1144
#define DAC3REF_R4                    1145
#define DAC3REF_REF4                  1146
#define DAC3R4                        1147
#define DAC3REF5                      1148
#define DAC3REF_REF5                  1149
#define PWM3DCL                       1150
#define PWM3DC0                       1151
#define PWMPW0                        1152
#define PWM3DCL_DC                    1153
#define DC0                           1154
#define PWM3DC1                       1155
#define PWMPW1                        1156
#define DC1                           1157
#define PWM3DCH                       1158
#define PWM3DC2                       1159
#define PWMPW2                        1160
#define PWM3DCH_DC                    1161
#define DC2                           1162
#define PWM3DC3                       1163
#define PWMPW3                        1164
#define DC3                           1165
#define PWM3DC4                       1166
#define PWMPW4                        1167
#define DC4                           1168
#define PWM3DC5                       1169
#define PWMPW5                        1170
#define DC5                           1171
#define PWM3DC6                       1172
#define PWMPW6                        1173
#define DC6                           1174
#define PWM3DC7                       1175
#define PWMPW7                        1176
#define DC7                           1177
#define PWMPW8                        1178
#define PWM3DC8                       1179
#define DC8                           1180
#define PWMPW9                        1181
#define PWM3DC9                       1182
#define DC9                           1183
#define PWM3CON                       1184
#define PWM3CON_POL                   1185
#define PWM3POL                       1186
#define PWM3CON_OUT                   1187
#define PWM3OUT                       1188
#define PWM3EN                        1189
#define PWM3CON_EN                    1190
#define COG1PHR                       1191
#define G1PHR0                        1192
#define PHR                           1193
#define PHR0                          1194
#define G1PHR1                        1195
#define PHR1                          1196
#define G1PHR2                        1197
#define PHR2                          1198
#define G1PHR3                        1199
#define PHR3                          1200
#define G1PHR4                        1201
#define PHR4                          1202
#define G1PHR5                        1203
#define PHR5                          1204
#define COG1PHF                       1205
#define G1PHF0                        1206
#define PHF                           1207
#define PHF0                          1208
#define G1PHF1                        1209
#define PHF1                          1210
#define G1PHF2                        1211
#define PHF2                          1212
#define G1PHF3                        1213
#define PHF3                          1214
#define G1PHF4                        1215
#define PHF4                          1216
#define G1PHF5                        1217
#define PHF5                          1218
#define COG1BLKR                      1219
#define BLKR                          1220
#define BLKR0                         1221
#define G1BLKR0                       1222
#define BLKR1                         1223
#define G1BLKR1                       1224
#define BLKR2                         1225
#define G1BLKR2                       1226
#define BLKR3                         1227
#define G1BLKR3                       1228
#define BLKR4                         1229
#define G1BLKR4                       1230
#define BLKR5                         1231
#define G1BLKR5                       1232
#define COG1BLKF                      1233
#define BLKF                          1234
#define G1BLKF0                       1235
#define BLKF0                         1236
#define G1BLKF1                       1237
#define BLKF1                         1238
#define G1BLKF2                       1239
#define BLKF2                         1240
#define G1BLKF3                       1241
#define BLKF3                         1242
#define G1BLKF4                       1243
#define BLKF4                         1244
#define G1BLKF5                       1245
#define BLKF5                         1246
#define COG1DBR                       1247
#define G1DBR0                        1248
#define DBR                           1249
#define DBR0                          1250
#define G1DBR1                        1251
#define DBR1                          1252
#define G1DBR2                        1253
#define DBR2                          1254
#define G1DBR3                        1255
#define DBR3                          1256
#define G1DBR4                        1257
#define DBR4                          1258
#define G1DBR5                        1259
#define DBR5                          1260
#define COG1DBF                       1261
#define G1DBF0                        1262
#define DBF0                          1263
#define G1DBF                         1264
#define G1DBF1                        1265
#define DBF1                          1266
#define G1DBF2                        1267
#define DBF2                          1268
#define G1DBF3                        1269
#define DBF3                          1270
#define G1DBF4                        1271
#define DBF4                          1272
#define G1DBF5                        1273
#define DBF5                          1274
#define COG1CON0                      1275
#define G1MD0                         1276
#define MD0                           1277
#define MD                            1278
#define G1MD                          1279
#define G1MD1                         1280
#define MD1                           1281
#define G1MD2                         1282
#define MD2                           1283
#define COG1CON0_CS0                  1284
#define G1CS                          1285
#define G1CS0                         1286
#define COG1CON0_CS                   1287
#define COG1CON0_CS1                  1288
#define G1CS1                         1289
#define G1LD                          1290
#define LD                            1291
#define COG1CON0_EN                   1292
#define G1EN                          1293
#define COG1CON1                      1294
#define G1POLA                        1295
#define POLA                          1296
#define POLB                          1297
#define G1POLB                        1298
#define G1POLC                        1299
#define POLC                          1300
#define POLD                          1301
#define G1POLD                        1302
#define G1FDBS                        1303
#define FDBS                          1304
#define RDBS                          1305
#define G1RDBS                        1306
#define COG1RIS0                      1307
#define G1RIS0                        1308
#define RIS0                          1309
#define G1RIS1                        1310
#define RIS1                          1311
#define G1RIS2                        1312
#define RIS2                          1313
#define G1RIS3                        1314
#define RIS3                          1315
#define G1RIS4                        1316
#define RIS4                          1317
#define G1RIS5                        1318
#define RIS5                          1319
#define G1RIS6                        1320
#define RIS6                          1321
#define G1RIS7                        1322
#define RIS7                          1323
#define COG1RIS1                      1324
#define G1RIS8                        1325
#define RIS8                          1326
#define G1RIS9                        1327
#define RIS9                          1328
#define RIS10                         1329
#define G1RIS10                       1330
#define RIS11                         1331
#define G1RIS11                       1332
#define RIS12                         1333
#define G1RIS12                       1334
#define RIS13                         1335
#define G1RIS13                       1336
#define RIS14                         1337
#define G1RIS14                       1338
#define COG1RSIM0                     1339
#define G1RSIM0                       1340
#define RSIM0                         1341
#define G1RSIM1                       1342
#define RSIM1                         1343
#define G1RSIM2                       1344
#define RSIM2                         1345
#define G1RSIM3                       1346
#define RSIM3                         1347
#define G1RSIM4                       1348
#define RSIM4                         1349
#define G1RSIM5                       1350
#define RSIM5                         1351
#define G1RSIM6                       1352
#define RSIM6                         1353
#define G1RSIM7                       1354
#define RSIM7                         1355
#define COG1RSIM1                     1356
#define RSIM8                         1357
#define G1RSIM8                       1358
#define RSIM9                         1359
#define G1RSIM9                       1360
#define RSIM10                        1361
#define G1RSIM10                      1362
#define RSIM11                        1363
#define G1RSIM11                      1364
#define RSIM12                        1365
#define G1RSIM12                      1366
#define RSIM13                        1367
#define G1RSIM13                      1368
#define RSIM14                        1369
#define G1RSIM14                      1370
#define COG1FIS0                      1371
#define FIS0                          1372
#define G1FIS0                        1373
#define FIS1                          1374
#define G1FIS1                        1375
#define G1FIS2                        1376
#define FIS2                          1377
#define G1FIS3                        1378
#define FIS3                          1379
#define G1FIS4                        1380
#define FIS4                          1381
#define G1FIS5                        1382
#define FIS5                          1383
#define G1FIS6                        1384
#define FIS6                          1385
#define FIS7                          1386
#define G1FIS7                        1387
#define COG1FIS1                      1388
#define FIS8                          1389
#define G1FIS8                        1390
#define FIS9                          1391
#define G1FIS9                        1392
#define G1FIS10                       1393
#define FIS10                         1394
#define G1FIS11                       1395
#define FIS11                         1396
#define G1FIS12                       1397
#define FIS12                         1398
#define G1FIS13                       1399
#define FIS13                         1400
#define G1FIS14                       1401
#define FIS14                         1402
#define COG1FSIM0                     1403
#define G1FSIM0                       1404
#define FSIM0                         1405
#define G1FSIM1                       1406
#define FSIM1                         1407
#define G1FSIM2                       1408
#define FSIM2                         1409
#define G1FSIM3                       1410
#define FSIM3                         1411
#define G1FSIM4                       1412
#define FSIM4                         1413
#define G1FSIM5                       1414
#define FSIM5                         1415
#define G1FSIM6                       1416
#define FSIM6                         1417
#define G1FSIM7                       1418
#define FSIM7                         1419
#define COG1FSIM1                     1420
#define FSIM8                         1421
#define G1FSIM8                       1422
#define FSIM9                         1423
#define G1FSIM9                       1424
#define FSIM10                        1425
#define G1FSIM10                      1426
#define FSIM11                        1427
#define G1FSIM11                      1428
#define FSIM12                        1429
#define G1FSIM12                      1430
#define FSIM13                        1431
#define G1FSIM13                      1432
#define FSIM14                        1433
#define G1FSIM14                      1434
#define COG1ASD0                      1435
#define ASDAC0                        1436
#define G1ASDAC0                      1437
#define ASDAC                         1438
#define G1ASDAC                       1439
#define G1ASDAC1                      1440
#define ASDAC1                        1441
#define G1ASDBD0                      1442
#define ASDBD0                        1443
#define ASDBD                         1444
#define G1ASDBD                       1445
#define ASDBD1                        1446
#define G1ASDBD1                      1447
#define ASREN                         1448
#define ARSEN                         1449
#define G1ARSEN                       1450
#define G1ASREN                       1451
#define ASE                           1452
#define G1ASE                         1453
#define COG1ASD1                      1454
#define AS0E                          1455
#define G1AS0E                        1456
#define AS1E                          1457
#define G1AS1E                        1458
#define AS2E                          1459
#define G1AS2E                        1460
#define AS3E                          1461
#define G1AS3E                        1462
#define AS4E                          1463
#define G1AS4E                        1464
#define AS5E                          1465
#define G1AS5E                        1466
#define AS6E                          1467
#define G1AS6E                        1468
#define G1AS7E                        1469
#define AS7E                          1470
#define COG1STR                       1471
#define STRA                          1472
#define G1STRA                        1473
#define STRB                          1474
#define G1STRB                        1475
#define STRC                          1476
#define G1STRC                        1477
#define G1STRD                        1478
#define STRD                          1479
#define SDATA                         1480
#define G1SDATA                       1481
#define SDATB                         1482
#define G1SDATB                       1483
#define G1SDATC                       1484
#define SDATC                         1485
#define SDATD                         1486
#define G1SDATD                       1487
#define PRG1RTSS                      1488
#define RTSS                          1489
#define RG1RTSS0                      1490
#define RTSS0                         1491
#define RG1RTSS1                      1492
#define RTSS1                         1493
#define RG1RTSS2                      1494
#define RTSS2                         1495
#define RG1RTSS3                      1496
#define RTSS3                         1497
#define PRG1FTSS                      1498
#define RG1FTSS0                      1499
#define FTSS0                         1500
#define FTSS                          1501
#define RG1FTSS1                      1502
#define FTSS1                         1503
#define RG1FTSS2                      1504
#define FTSS2                         1505
#define RG1FTSS3                      1506
#define FTSS3                         1507
#define PRG1INS                       1508
#define INS                           1509
#define INS0                          1510
#define RG1INS0                       1511
#define INS1                          1512
#define RG1INS1                       1513
#define INS2                          1514
#define RG1INS2                       1515
#define INS3                          1516
#define RG1INS3                       1517
#define PRG1CON0                      1518
#define RG1GO                         1519
#define PRG1CON0_GO                   1520
#define RG1OS                         1521
#define OS                            1522
#define RG1MODE                       1523
#define PRG1CON0_MODE0                1524
#define PRG1CON0_MODE                 1525
#define RG1MODE0                      1526
#define PRG1CON0_MODE1                1527
#define RG1MODE1                      1528
#define RG1REDG                       1529
#define REDG                          1530
#define FEDG                          1531
#define RG1FEDG                       1532
#define RG1EN                         1533
#define PRG1CON0_EN                   1534
#define PRG1CON1                      1535
#define RG1RPOL                       1536
#define RPOL                          1537
#define FPOL                          1538
#define RG1FPOL                       1539
#define RDY                           1540
#define RG1RDY                        1541
#define PRG1CON2                      1542
#define RG1ISET0                      1543
#define ISET                          1544
#define RG1ISET                       1545
#define ISET0                         1546
#define RG1ISET1                      1547
#define ISET1                         1548
#define RG1ISET2                      1549
#define ISET2                         1550
#define RG1ISET3                      1551
#define ISET3                         1552
#define RG1ISET4                      1553
#define ISET4                         1554
#define PWMEN                         1555
#define MPWM5EN                       1556
#define PWMLD                         1557
#define MPWM5LD                       1558
#define PWMOUT                        1559
#define MPWM5OUT                      1560
#define PWM5PHL0                      1561
#define PWM5PHL_PH                    1562
#define PWM5PHL                       1563
#define PWM5PHL1                      1564
#define PWM5PHL2                      1565
#define PWM5PHL3                      1566
#define PWM5PHL4                      1567
#define PWM5PHL5                      1568
#define PWM5PHL6                      1569
#define PWM5PHL7                      1570
#define PWM5PHH0                      1571
#define PWM5PHH_PH                    1572
#define PWM5PHH                       1573
#define PWM5PHH1                      1574
#define PWM5PHH2                      1575
#define PWM5PHH3                      1576
#define PWM5PHH4                      1577
#define PWM5PHH5                      1578
#define PWM5PHH6                      1579
#define PWM5PHH7                      1580
#define PWM5DCL_DC                    1581
#define PWM5DCL                       1582
#define PWM5DCL0                      1583
#define PWM5DCL1                      1584
#define PWM5DCL2                      1585
#define PWM5DCL3                      1586
#define PWM5DCL4                      1587
#define PWM5DCL5                      1588
#define PWM5DCL6                      1589
#define PWM5DCL7                      1590
#define PWM5DCH_DC                    1591
#define PWM5DCH                       1592
#define PWM5DCH0                      1593
#define PWM5DCH1                      1594
#define PWM5DCH2                      1595
#define PWM5DCH3                      1596
#define PWM5DCH4                      1597
#define PWM5DCH5                      1598
#define PWM5DCH6                      1599
#define PWM5DCH7                      1600
#define PWM5PRL0                      1601
#define PWM5PRL_PR                    1602
#define PWM5PRL                       1603
#define PWM5PRL1                      1604
#define PWM5PRL2                      1605
#define PWM5PRL3                      1606
#define PWM5PRL4                      1607
#define PWM5PRL5                      1608
#define PWM5PRL6                      1609
#define PWM5PRL7                      1610
#define PWM5PRH_PR                    1611
#define PWM5PRH0                      1612
#define PWM5PRH                       1613
#define PWM5PRH1                      1614
#define PWM5PRH2                      1615
#define PWM5PRH3                      1616
#define PWM5PRH4                      1617
#define PWM5PRH5                      1618
#define PWM5PRH6                      1619
#define PWM5PRH7                      1620
#define PWM5OFL                       1621
#define PWM5OFL0                      1622
#define PWM5OFL_OF                    1623
#define PWM5OFL1                      1624
#define PWM5OFL2                      1625
#define PWM5OFL3                      1626
#define PWM5OFL4                      1627
#define PWM5OFL5                      1628
#define PWM5OFL6                      1629
#define PWM5OFL7                      1630
#define PWM5OFH_OF                    1631
#define PWM5OFH                       1632
#define PWM5OFH0                      1633
#define PWM5OFH1                      1634
#define PWM5OFH2                      1635
#define PWM5OFH3                      1636
#define PWM5OFH4                      1637
#define PWM5OFH5                      1638
#define PWM5OFH6                      1639
#define PWM5OFH7                      1640
#define PWM5TMRL_TMR                  1641
#define PWM5TMRL                      1642
#define PWM5TMRL0                     1643
#define PWM5TMRL1                     1644
#define PWM5TMRL2                     1645
#define PWM5TMRL3                     1646
#define PWM5TMRL4                     1647
#define PWM5TMRL5                     1648
